# Homebrew Bundle - All packages and apps

# Core CLI Tools
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Development Tools
brew "neovim"
brew "tmux"
brew "fzf"
brew "ripgrep"
brew "tree-sitter"
brew "gh"              # GitHub CLI
brew "node"
brew "nvm"
brew "python3"

# Session & Navigation
brew "sesh"            # Smart tmux session manager
brew "zoxide"          # Fast directory jumper (used by sesh)

# Terminal Enhancement
brew "starship"        # Prompt

# GUI Applications
tap "nikitabobko/tap"
cask "aerospace"
cask "ghostty"
cask "google-chrome"
cask "monitorcontrol"
cask "obsidian"
