# Homebrew Bundle - All packages and apps
# tap "nikitabobko/tap"

# Core CLI Tools
brew "bash"            # Bash 5+ (required by tmux-powerkit plugin)
brew "zsh"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Development Tools
brew "neovim"
brew "tmux"
brew "fzf"
brew "ripgrep"
brew "tree-sitter"
brew "gh"              # GitHub CLI
brew "node"
brew "nvm"
brew "python@3.12"     # Required by Mason (checks python3.12 specifically)
brew "pandoc"           # Markdown → EPUB/PDF/HTML converter
brew "rbenv"
brew "ruby-build"
brew "watchman"            # Required by rubocop and sorbet for file watching
brew "lazygit"

# Navigation
brew "zoxide"          # Fast directory jumper (z command)

# Terminal Enhancement
brew "starship"        # Prompt
brew "coreutils"       # GNU core utils (grealpath for yazi)

# GUI Applications
cask "ghostty"
cask "google-chrome"
cask "monitorcontrol"
cask "obsidian"
cask "voiceink"

cask "nikitabobko/tap/aerospace"

cask "font-psudofont-liga-mono"
